
    // Массив с примерными трек-номерами
    const validTrackNumbers = ['78482856755066', '78482847407861', 'JT5351002738799', 'JT5351754793412', 'JT5351239219163',
    'JT5351740749037', 'JT5351740749037', 'JT5351499986728', 'JT5351225171571', 'JT5351260139685',
    'JT5351130147945', 'JT5351493862224', 'JT5351140445073', 'JT5351942306921', 'JT5351873056302',
    'JT5351509730557', 'JT5350988801367', 'JT5351204860186', 'JT5351897827343', 'JT5351829181422',
    'JT5351280341609', 'JT5351114949234', 'JT5351073774695', 'JT5350984418468', '777282474838321',
    'JT5351140445073', 'JT5351942306921', 'JT5351873056302', 'JT5351509730557', 'JT5350988801367',
    'JT5351204860186', 'JT5351897827343', 'JT5351829181422', 'JT5351280341609', 'JT5351114949234',
    'JT5351073774695', 'JT5351239219163', '777282768513848', 'YT8738186310275', 'JT5351074859806',
    'JT5351375556998', 'JT5350433548958', 'JT5350433548958', 'JT5351114968693', 'JT5350443721476',
    'JT5350464825211', 'JT5351566172370', 'JT5351371724589', 'JT5351106303513', 'JT5351251662446',
    'JT5351375556998', 'JT5351251662446', 'JT5351375556998',
];

    // Добавляем обработчик на кнопку
    document.getElementById('check-button').addEventListener('click', function () {
      const trackNumber = document.getElementById('track-number').value.trim(); // Получаем введённый номер
      const result = document.getElementById('result'); // Элемент для вывода результата

      if (!trackNumber) { // Если поле пустое
        result.textContent = 'Трек номератонро нависед!';
        result.style.color = 'red';
        return;
      }

      // Проверяем, есть ли трек-номер в списке
      if (validTrackNumbers.includes(trackNumber)) {
        result.textContent = `Қабул ${trackNumber} шудааст!`; // Используем обратные кавычки
        result.style.color = 'orange';
      } else {
        result.textContent = 'Трек-номери шумо нест!';
        result.style.color = 'orange';
      }
    });
  
